results/4-loadtest/ibm_results/ibm_python_1000.txt
Running 1m test @ https://us-east.functions.cloud.ibm.com/api/v1/web/functionOrg_functionSpace/default/python_matrix.json
  2 threads and 1000 connections
  Thread calibration: mean lat.: 902.800ms, rate sampling interval: 3438ms
  Thread calibration: mean lat.: 892.167ms, rate sampling interval: 3434ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   546.97ms  139.38ms   3.53s    75.97%
    Req/Sec   501.00     31.46   568.00     57.69%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  517.89ms
 75.000%  607.74ms
 90.000%  728.06ms
 99.000%  973.31ms
 99.900%    1.39s 
 99.990%    2.62s 
 99.999%    3.53s 
100.000%    3.53s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     306.943     0.000000            1         1.00
     407.295     0.100000         4792         1.11
     439.807     0.200000         9582         1.25
     466.175     0.300000        14368         1.43
     491.519     0.400000        19160         1.67
     517.887     0.500000        23935         2.00
     532.479     0.550000        26312         2.22
     547.839     0.600000        28731         2.50
     563.711     0.650000        31093         2.86
     583.167     0.700000        33487         3.33
     607.743     0.750000        35877         4.00
     620.543     0.775000        37040         4.44
     635.903     0.800000        38249         5.00
     653.823     0.825000        39448         5.71
     675.327     0.850000        40648         6.67
     699.903     0.875000        41824         8.00
     714.239     0.887500        42422         8.89
     728.063     0.900000        43021        10.00
     744.447     0.912500        43627        11.43
     762.367     0.925000        44217        13.33
     782.335     0.937500        44805        16.00
     795.135     0.943750        45123        17.78
     809.471     0.950000        45417        20.00
     824.831     0.956250        45708        22.86
     839.679     0.962500        46001        26.67
     860.159     0.968750        46298        32.00
     873.471     0.971875        46448        35.56
     888.319     0.975000        46597        40.00
     903.167     0.978125        46748        45.71
     919.039     0.981250        46895        53.33
     942.079     0.984375        47049        64.00
     950.783     0.985938        47123        71.11
     961.023     0.987500        47196        80.00
     969.215     0.989062        47271        91.43
     978.943     0.990625        47344       106.67
     991.231     0.992188        47418       128.00
    1003.007     0.992969        47455       142.22
    1015.295     0.993750        47493       160.00
    1026.559     0.994531        47530       182.86
    1037.311     0.995313        47567       213.33
    1053.695     0.996094        47605       256.00
    1064.959     0.996484        47623       284.44
    1079.295     0.996875        47642       320.00
    1116.159     0.997266        47661       365.71
    1143.807     0.997656        47679       426.67
    1200.127     0.998047        47699       512.00
    1222.655     0.998242        47707       568.89
    1261.567     0.998437        47717       640.00
    1316.863     0.998633        47727       731.43
    1336.319     0.998828        47735       853.33
    1392.639     0.999023        47745      1024.00
    1420.287     0.999121        47749      1137.78
    1451.007     0.999219        47754      1280.00
    1577.983     0.999316        47759      1462.86
    1653.759     0.999414        47763      1706.67
    1738.751     0.999512        47768      2048.00
    1766.399     0.999561        47770      2275.56
    1791.999     0.999609        47773      2560.00
    1922.047     0.999658        47775      2925.71
    1991.679     0.999707        47777      3413.33
    2250.751     0.999756        47780      4096.00
    2324.479     0.999780        47781      4551.11
    2332.671     0.999805        47782      5120.00
    2478.079     0.999829        47783      5851.43
    2541.567     0.999854        47784      6826.67
    2623.487     0.999878        47786      8192.00
    2623.487     0.999890        47786      9102.22
    2793.471     0.999902        47787     10240.00
    2793.471     0.999915        47787     11702.86
    2844.671     0.999927        47788     13653.33
    3039.231     0.999939        47789     16384.00
    3039.231     0.999945        47789     18204.44
    3039.231     0.999951        47789     20480.00
    3039.231     0.999957        47789     23405.71
    3244.031     0.999963        47790     27306.67
    3244.031     0.999969        47790     32768.00
    3244.031     0.999973        47790     36408.89
    3244.031     0.999976        47790     40960.00
    3244.031     0.999979        47790     46811.43
    3530.751     0.999982        47791     54613.33
    3530.751     1.000000        47791          inf
#[Mean    =      546.968, StdDeviation   =      139.383]
#[Max     =     3528.704, Total count    =        47791]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  58623 requests in 1.00m, 50.93MB read
  Socket errors: connect 0, read 0, write 0, timeout 32
Requests/sec:    976.44
Transfer/sec:    868.69KB